def _(message):
    return message

# _() function for gettext translation
start_ = _("Some start message")

canceled_ = _('Отменено')

cancel_ = _('Отмена')

start_rules_ = _("Вы подтверждаете, что ознакомились и согласны с условиями предоставления услуг?")

hello_msg_ = _("Приветствую, {}!\n\n Это P2P сервис, позволяющий быстро и безопасно обменивать BTC.")

wallet_ = _('💰 Кошелек')

my_advs_ = _('Мои заявки 📨')

advs_msg_ = _('*Заявки 📨*\n\nВнизу вы можете увидеть список своих объявлений.\n\n*Биржевой курс:* {}')

exchange_ = _("📊 Купить/продать")

settings_ = _("🔩 Настройки")

settings_msg_  = _("*🔩 Настройки*\n\nЗдесь вы можете изменить параметры своего аккаунта.")

about_ = _("ℹ О сервисе")

buy_ = _('Покупка ({})')

buy_button_ = _("Купить 📈")

sell_button_ = _("продать 📉")

sell_ = _('Продажа ({})')

back_ = _('Назад')

next_ = _('Вперед')

deposit_ = _("Внести 📥")

withdraw_ = _("Вывести 📤")

wallet_msg_ = _("*Bitcoin кошелек*\n\n*Баланс*: {}  BTC\n\n*Примерно*: {} RUB")

deposit_msg_ = _("📥 *Внести Bitcoin*\n\nДля пополнения BTC используйте адрес ниже.")

withdraw_msg_ = _('📤 *Вывести Bitcoin*\n\nНапишите адрес внешнего BTC кошелька.')

chk_addr_ok_ = _('Введите сумму для вывода в BTC.')

incorrect_input_ = _('Некорректный ввод. Повторите попытку.')

chk_sum_ok_ = _('Заявка на вывод средств принята.')

low_funds_ = _('Недостаточно средств. Повторите попытку.')

buy_text_ = _('📈 *Купить {}*\n\nВыберите удобный для Вас способ оплаты.\n\n*Биржевой курс:* {}')

buy_list_ = _('📈 *Купить {}*\n\nВ этом списке {} заявки для {}. Выберите подходящую и откройте сделку.')

sell_list_ = _('📉 *Продать {}*\n\nВ этом списке {} заявки для {}. Выберите подходящую и откройте сделку.')

sell_text_ = _('📉 *Продать {}*\n\nВыберите удобный для Вас способ оплаты.\n\n*Биржевой курс:* {}')

buy_order_ = _('📈 *Купить {}* ({})\n\n*Пользователь:* @{}\n\n*Сообщение:* {}\n\nВы можете купить {} по курсу {} {} на сумму от *{} {}* до *{} {}*.')

sell_order_ = _('📉 *Продать {}* ({})\n\n*Пользователь:* @{}\n\n*Сообщение:* {}\n\nВы можете продать {} по курсу {} {} на сумму от *{} {}* до *{} {}*.')

no_advs_ = _('Не найдено ни одного объявления для указанной валюты: {}.')

trade_msg_ = _('*📊 Купить/продать {}*\n\nЗдесь вы можете покупать и продавать {}.\n\n*Биржевой курс:* {}')

start_deal_ = _('Начать сделку 💸')

add_ = _('Добавить 🗳')

choose_fiat_ = _('Выберите валюту 💵')

fiat_msg_ = _('*💵 Валюта*\n\nВыбранная вами валюта будет использована при подборе и создании объявлений.')

choose_crypto_ = _('Выберите криптовалюту 🔐')

crypto_msg = _('*🔐 Криптовалюта*\n\nВыбранная вами криптовалюта будет использована при подборе и создании объявлений.')

adv_create_1_ = _('Выберите тип объявления.')

adv_create_2_ = _('Выберите метод оплаты.\n\nЕсли нужного метода нет в списке, значит у вас уже есть объявление с этой платежной системой.')

adv_create_3_ = _('Установите курс для этого объявления. Вы можете ввести наценку в процентах или фиксированное значение.\n\nНапример: *2% или 244300*')

adv_create_4_ = _('Установите описание для вашего объявления. Оно должно содержать реквизиты для платежа или другие инструкции.')

adv_created = _('Ваше заявление было сохранено!')
